wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/CMSIS/GD/GD32H77x/Include/gd32h77x.h
    TIMER44_IRQn                    = 169,    /*!< TIMER44 global interrupt                                                             */
    TIMER50_IRQn                    = 170,    /*!< TIMER50 global interrupt                                                             */
    TIMER51_IRQn                    = 171,    /*!< TIMER51 global interrupt                                                             */
    USBHS1_EP1_OUT_IRQn             = 172,    /*!< USBHS1 endpoint 1 out interrupt                                                      */
    USBHS1_EP1_IN_IRQn              = 173,    /*!< USBHS1 endpoint 1 in interrupt                                                       */
    USBHS1_WKUP_IRQn                = 174,    /*!< USBHS1 wakeup from EXTI interrupt                                                    */
    USBHS1_IRQn                     = 175,    /*!< USBHS1 global interrupt                                                              */
    ENET1_IRQn                      = 176,    /*!< ENET1 global interrupt                                                               */
    ENET1_WKUP_IRQn                 = 177,    /*!< ENET1 wakeup from EXTI interrupt                                                     */
    CAN0_WKUP_IRQn                  = 179,    /*!< CAN0 wakeup through EXTI line detection interrupt                                    */
    CAN0_Message_IRQn               = 180,    /*!< CAN0 interrupt for message buffer                                                    */
    CAN0_Busoff_IRQn                = 181,    /*!< CAN0 interrupt for bus off / bus off done                                            */
    CAN0_Error_IRQn                 = 182,    /*!< CAN0 interrupt for error                                                             */
    CAN0_FastError_IRQn             = 183,    /*!< CAN0 interrupt for error in fast transmission                                        */
    CAN0_TEC_IRQn                   = 184,    /*!< CAN0 interrupt for transmit warning                                                  */
    CAN0_REC_IRQn                   = 185,    /*!< CAN0 interrupt for receive warning                                                   */
    CAN1_WKUP_IRQn                  = 186,    /*!< CAN1 wakeup through EXTI line detection interrupt                                    */
    CAN1_Message_IRQn               = 187,    /*!< CAN1 interrupt for message buffer                                                    */
    CAN1_Busoff_IRQn                = 188,    /*!< CAN1 interrupt for bus off / bus off done                                            */
    CAN1_Error_IRQn                 = 189,    /*!< CAN1 interrupt for error                                                             */
    CAN1_FastError_IRQn             = 190,    /*!< CAN1 interrupt for error in fast transmission                                        */
    CAN1_TEC_IRQn                   = 191,    /*!< CAN1 interrupt for transmit warning                                                  */
    CAN1_REC_IRQn                   = 192,    /*!< CAN1 interrupt for receive warning                                                   */
    CAN2_WKUP_IRQn                  = 193,    /*!< CAN2 wakeup through EXTI line detection interrupt                                    */
    CAN2_Message_IRQn               = 194,    /*!< CAN2 interrupt for message buffer                                                    */
    CAN2_Busoff_IRQn                = 195,    /*!< CAN2 interrupt for bus off / bus off done                                            */
    CAN2_Error_IRQn                 = 196,    /*!< CAN2 interrupt for error                                                             */
    CAN2_FastError_IRQn             = 197,    /*!< CAN2 interrupt for error in fast transmission                                        */
    CAN2_TEC_IRQn                   = 198,    /*!< CAN2 interrupt for transmit warning                                                  */
    CAN2_REC_IRQn                   = 199,    /*!< CAN2 interrupt for receive warning                                                   */
    OTP_IRQn                        = 200,    /*!< OTP global interrupt                                                                 */
    I2C0_WKUP_IRQn                  = 201,    /*!< I2C0 wakeup through EXTI line detection interrupt                                    */
    I2C1_WKUP_IRQn                  = 202,    /*!< I2C1 wakeup through EXTI line detection interrupt                                    */
    I2C2_WKUP_IRQn                  = 203,    /*!< I2C2 wakeup through EXTI line detection interrupt                                    */
    I2C3_WKUP_IRQn                  = 204,    /*!< I2C3 wakeup through EXTI line detection interrupt                                    */
    LPDTS_IRQn                      = 205,    /*!< LPDTS interrupt                                                                      */
    LPDTS_WKUP_IRQn                 = 206,    /*!< LPDTS wakeup through EXTI line detection interrupt                                   */
    TIMER0_DEC_IRQn                 = 207,    /*!< TIMER0 DEC interrupt                                                                 */
    TIMER7_DEC_IRQn                 = 208,    /*!< TIMER7 DEC interrupt                                                                 */
    TIMER1_DEC_IRQn                 = 209,    /*!< TIMER1 DEC interrupt                                                                 */
    TIMER2_DEC_IRQn                 = 210,    /*!< TIMER2 DEC interrupt                                                                 */
    TIMER3_DEC_IRQn                 = 211,    /*!< TIMER3 DEC interrupt                                                                 */
    TIMER4_DEC_IRQn                 = 212,    /*!< TIMER4 DEC interrupt                                                                 */
    TIMER22_DEC_IRQn                = 213,    /*!< TIMER22 DEC interrupt                                                                */
    TIMER23_DEC_IRQn                = 214,    /*!< TIMER23 DEC interrupt                                                                */
    TIMER30_DEC_IRQn                = 215,    /*!< TIMER30 DEC interrupt                                                                */
    TIMER31_DEC_IRQn                = 216,    /*!< TIMER31 DEC interrupt                                                                */
    CPU_DCACHE_ERR_IRQn             = 217,    /*!< CPU D-Cache error detection interrupt                                                */
    CPU_ICACHE_ERR_IRQn             = 218,    /*!< CPU I-Cache error detection interrupt                                                */
    VCORE_OVER_UNDER_VOLTAGE_IRQn   = 219,    /*!< VCORE overvoltage / undervoltage detection interrupt                                 */
    TIMER0_Channel_BRK_IRQn         = 221,    /*!< TIMER0 channel break interrupt                                                       */
    TIMER7_Channel_BRK_IRQn         = 222,    /*!< TIMER7 channel break interrupt                                                       */
    DSI_IRQn                        = 223,    /*!< DSI global interrupt                                                                 */
    PKCAU_IRQn                      = 224,    /*!< PKCAU global interrupt                                                               */
    ESC_BRIDGE_IRQn                 = 225,    /*!< ESC internal interrupt                                                               */
    EDIM_IRQn                       = 226     /*!< EDIM global interrupt                                                                */
} IRQn_Type;

/* includes */
#include "core_cm7.h"
#include "system_gd32h77x.h"
#include <stdint.h>
#ifdef FW_DEBUG_ERR_REPORT
#include "gd32h77x_err_report.h"
#endif /* FW_DEBUG_ERR_REPORT */

/* enum definitions */
typedef enum {DISABLE = 0, ENABLE = !DISABLE} EventStatus, ControlStatus;
typedef enum {RESET = 0, SET = !RESET} FlagStatus;
typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrStatus;

/* bit operations */
#define REG64(addr)                  (*(volatile uint64_t *)(uint32_t)(addr))
#define REG32(addr)                  (*(volatile uint32_t *)(uint32_t)(addr))
#define REG16(addr)                  (*(volatile uint16_t *)(uint32_t)(addr))
#define REG8(addr)                   (*(volatile uint8_t *)(uint32_t)(addr))
#define BIT(x)                       ((uint32_t)((uint32_t)0x01U << (x)))
#define BITS(start, end)             ((0xFFFFFFFFUL << (start)) & (0xFFFFFFFFUL >> (31U - (uint32_t)(end)))) 
#define GET_BITS(regval, start, end) (((regval) & BITS((start),(end))) >> (start))

